[ada] - feat(docs): reformular diagrama de casos de uso em plantuml e exportar svg
